content/posts/Joachim_Krug.md
+++
title = "Joachim Krug"
author = ["Cameron Smith"]
lastmod = 2020-09-20T17:34:52-04:00
slug = "Joachim_Krug"
draft = false
+++

## [references]({{< relref "references" >}}) {#references--references-dot-md}


### Krug, J. (2019). Accessibility percolation in random fitness landscapes. Retrieved from <http://arxiv.org/abs/1903.11913> {#krug-j-dot--2019--dot-accessibility-percolation-in-random-fitness-landscapes-dot-retrieved-from-http-arxiv-dot-org-abs-1903-dot-11913}


### Krug, J. (2018). Population Genetics and Evolution. Retrieved from <http://arxiv.org/abs/1803.08474> {#krug-j-dot--2018--dot-population-genetics-and-evolution-dot-retrieved-from-http-arxiv-dot-org-abs-1803-dot-08474}


### Hwang, S., Schmiegelt, B., Ferretti, L., & Krug, J. (2018). Universality Classes of Interaction Structures for NK Fitness Landscapes. <span class="underline"><span class="underline">Journal of Statistical Physics</span></span>, \_\_172\_\_(1), 226–278. <https://doi.org/10.1007/s10955-018-1979-z> {#hwang-s-dot-schmiegelt-b-dot-ferretti-l-dot-and-krug-j-dot--2018--dot-universality-classes-of-interaction-structures-for-nk-fitness-landscapes-dot-172--1--226-278-dot-https-doi-dot-org-10-dot-1007-s10955-018-1979-z}


### Good, B. H., McDonald, M. J., Barrick, J. E., Lenski, R. E., & Desai, M. M. (2017). The dynamics of molecular evolution over 60,000 generations. <span class="underline"><span class="underline">Nature</span></span>, \_\_551\_\_(7678), 45–50. <https://doi.org/10.1038/nature24287> {#good-b-dot-h-dot-mcdonald-m-dot-j-dot-barrick-j-dot-e-dot-lenski-r-dot-e-dot-and-desai-m-dot-m-dot--2017--dot-the-dynamics-of-molecular-evolution-over-60-000-generations-dot-551--7678--45-50-dot-https-doi-dot-org-10-dot-1038-nature24287}


### Pearce, M. T., & Fisher, D. S. (2017). Rapid adaptation in large populations with very rare sex: Scalings and spontaneous oscillations. <span class="underline"><span class="underline">Theoretical Population Biology</span></span>. <https://doi.org/10.1016/j.tpb.2017.11.005> {#pearce-m-dot-t-dot-and-fisher-d-dot-s-dot--2017--dot-rapid-adaptation-in-large-populations-with-very-rare-sex-scalings-and-spontaneous-oscillations-dot-dot-https-doi-dot-org-10-dot-1016-j-dot-tpb-dot-2017-dot-11-dot-005}


### Park, S.-C., Szendro, I. G., Neidhart, J., & Krug, J. (2015). Phase transition in random adaptive walks on correlated fitness landscapes. <span class="underline"><span class="underline">Physical Review E</span></span>, \_\_91\_\_(4). <https://doi.org/10.1103/PhysRevE.91.042707> {#park-s-dot-c-dot-szendro-i-dot-g-dot-neidhart-j-dot-and-krug-j-dot--2015--dot-phase-transition-in-random-adaptive-walks-on-correlated-fitness-landscapes-dot-91--4--dot-https-doi-dot-org-10-dot-1103-physreve-dot-91-dot-042707}


### McCandlish, D. M., & Stoltzfus, A. (2014). Modeling Evolution Using the Probability of Fixation: History and Implications. <span class="underline"><span class="underline">The Quarterly Review of Biology</span></span>, \_\_89\_\_(3), 225–252. <https://doi.org/10.1086/677571> {#mccandlish-d-dot-m-dot-and-stoltzfus-a-dot--2014--dot-modeling-evolution-using-the-probability-of-fixation-history-and-implications-dot-89--3--225-252-dot-https-doi-dot-org-10-dot-1086-677571}


### De Visser, J. A. G. M., & Krug, J. (2014). Empirical fitness landscapes and the predictability of evolution. <span class="underline"><span class="underline">Nature Reviews Genetics</span></span>, \_\_15\_\_(7), 480–490. <https://doi.org/10.1038/nrg3744> {#de-visser-j-dot-a-dot-g-dot-m-dot-and-krug-j-dot--2014--dot-empirical-fitness-landscapes-and-the-predictability-of-evolution-dot-15--7--480-490-dot-https-doi-dot-org-10-dot-1038-nrg3744}


### Wiser, M. J., Ribeck, N., & Lenski, R. E. (2013). Long-Term Dynamics of Adaptation in Asexual Populations. <span class="underline"><span class="underline">Science</span></span>, \_\_342\_\_(6164), 1364–1367. <https://doi.org/10.1126/science.1243357> {#wiser-m-dot-j-dot-ribeck-n-dot-and-lenski-r-dot-e-dot--2013--dot-long-term-dynamics-of-adaptation-in-asexual-populations-dot-342--6164--1364-1367-dot-https-doi-dot-org-10-dot-1126-science-dot-1243357}


### Szendro, I. G., Franke, J., de Visser, J. A. G. M., & Krug, J. (2013). Predictability of evolution depends nonmonotonically on population size. <span class="underline"><span class="underline">Proceedings of the National Academy of Sciences of the United States of America</span></span>, \_\_110\_\_(2), 571–576. <https://doi.org/10.1073/pnas.1213613110> {#szendro-i-dot-g-dot-franke-j-dot-de-visser-j-dot-a-dot-g-dot-m-dot-and-krug-j-dot--2013--dot-predictability-of-evolution-depends-nonmonotonically-on-population-size-dot-110--2--571-576-dot-https-doi-dot-org-10-dot-1073-pnas-dot-1213613110}


### Szendro, I. G., Schenk, M. F., Franke, J., Krug, J., & de Visser, J. A. G. M. (2013). Quantitative analyses of empirical fitness landscapes. <span class="underline"><span class="underline">Journal of Statistical Mechanics: Theory and Experiment</span></span>, <span class="underline"><span class="underline">2013</span></span>, P01005. <https://doi.org/10.1088/1742-5468/2013/01/P01005> {#szendro-i-dot-g-dot-schenk-m-dot-f-dot-franke-j-dot-krug-j-dot-and-de-visser-j-dot-a-dot-g-dot-m-dot--2013--dot-quantitative-analyses-of-empirical-fitness-landscapes-dot-p01005-dot-https-doi-dot-org-10-dot-1088-1742-5468-2013-01-p01005}


### Krug, J. (2012). Statistical Physics of Biological Evolution. <span class="underline"><span class="underline">ArXiv</span></span>. Retrieved from <http://arxiv.org/abs/1204.2661> {#krug-j-dot--2012--dot-statistical-physics-of-biological-evolution-dot-dot-retrieved-from-http-arxiv-dot-org-abs-1204-dot-2661}


### Szendro, I. G., Franke, J., de Visser, J. A. G. M., & Krug, J. (2012). Predictability of evolution depends nonmonotonically on population size. <span class="underline"><span class="underline">Proceedings of the National Academy of Sciences of the United States of America</span></span>, 1–6. <https://doi.org/10.1073/pnas.1213613110> {#szendro-i-dot-g-dot-franke-j-dot-de-visser-j-dot-a-dot-g-dot-m-dot-and-krug-j-dot--2012--dot-predictability-of-evolution-depends-nonmonotonically-on-population-size-dot-1-6-dot-https-doi-dot-org-10-dot-1073-pnas-dot-1213613110}


### Neidhart, J., & Krug, J. (2011). Adaptive Walks and Extreme Value Theory. <span class="underline"><span class="underline">Physical Review Letters</span></span>, \_\_107\_\_(17), 178102. <https://doi.org/10.1103/PhysRevLett.107.178102> {#neidhart-j-dot-and-krug-j-dot--2011--dot-adaptive-walks-and-extreme-value-theory-dot-107--17--178102-dot-https-doi-dot-org-10-dot-1103-physrevlett-dot-107-dot-178102}


### Franke, J., Klözer, A., de Visser, J. A. G. M., & Krug, J. (2011). Evolutionary Accessibility of Mutational Pathways. <span class="underline"><span class="underline">PLoS Computational Biology</span></span>, \_\_7\_\_(8), e1002134. <https://doi.org/10.1371/journal.pcbi.1002134> {#franke-j-dot-klözer-a-dot-de-visser-j-dot-a-dot-g-dot-m-dot-and-krug-j-dot--2011--dot-evolutionary-accessibility-of-mutational-pathways-dot-7--8--e1002134-dot-https-doi-dot-org-10-dot-1371-journal-dot-pcbi-dot-1002134}


### Park, S. C., Simon, D., & Krug, J. (2010). The speed of evolution in large asexual populations. <span class="underline"><span class="underline">Journal of Statistical Physics</span></span>, \_\_138\_\_(1), 381–410. <https://doi.org/10.1007/s10955-009-9915-x> {#park-s-dot-c-dot-simon-d-dot-and-krug-j-dot--2010--dot-the-speed-of-evolution-in-large-asexual-populations-dot-138--1--381-410-dot-https-doi-dot-org-10-dot-1007-s10955-009-9915-x}


### Park, S.-C., & Krug, J. (2008). Evolution in random fitness landscapes: the infinite sites model. <span class="underline"><span class="underline">Journal of Statistical Mechanics: Theory and Experiment</span></span>, \_\_2008\_\_(4). <https://doi.org/10.1088/1742-5468/2008/04/P04014> {#park-s-dot-c-dot-and-krug-j-dot--2008--dot-evolution-in-random-fitness-landscapes-the-infinite-sites-model-dot-2008--4--dot-https-doi-dot-org-10-dot-1088-1742-5468-2008-04-p04014}


### Blount, Z. D., Borland, C. Z., & Lenski, R. E. (2008). Historical contingency and the evolution of a key innovation in an experimental population of Escherichia coli. <span class="underline"><span class="underline">PNAS</span></span>, \_\_105\_\_(23), 7899–7906. <https://doi.org/10.1073/pnas.0803151105> {#blount-z-dot-d-dot-borland-c-dot-z-dot-and-lenski-r-dot-e-dot--2008--dot-historical-contingency-and-the-evolution-of-a-key-innovation-in-an-experimental-population-of-escherichia-coli-dot-105--23--7899-7906-dot-https-doi-dot-org-10-dot-1073-pnas-dot-0803151105}


### Park, S.-C., & Krug, J. (2007). Clonal interference in large populations. <span class="underline"><span class="underline">Proceedings of the National Academy of Sciences of the United States of America</span></span>, \_\_104\_\_(46), 18135–18140. <https://doi.org/10.1073/pnas.0705778104> {#park-s-dot-c-dot-and-krug-j-dot--2007--dot-clonal-interference-in-large-populations-dot-104--46--18135-18140-dot-https-doi-dot-org-10-dot-1073-pnas-dot-0705778104}
